# Customer API - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-d7wEN4GWPYr7HUxP

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database_user.random_password.password: Refreshing state... [id=none]
module.aws_lambda.data.archive_file.default: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/lambda-customer-api-staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=h86ahn8llc]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging-20230424110012618100000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=2e6ca90fb5c2e42ab56d74c49058441c4407f4a4]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=aea7ce45-45d0-4f49-8033-aed9c13da58e:customer-api]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/api-gateway-customer-api-staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=lambda-customer-api-staging-customer-api]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=47d0qo7]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=hya6qy4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer-api"
    }

  # module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "lambda-customer-api-staging-customer-api"
      ~ last_modified                  = "2023-04-24T23:44:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "LStyWSt78fKcO4uzuZXDK6sS8qOUQjUj5yVYuc+LNok=" -> "R0E0Td/Bxv/VAiPK4Cff3EP5ET4m3m/FYJnjCiuZ2Ac="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = "postgresql://customer-api:%7Bee&9p6dMY%2A+vC$XL239uck%2AzUYtHx2KrcpouZeC+m$i$Q%28Mv$dcf%3CnmSB%3C%28%7BKv4@customer-shared-staging-customer-4505.6xw.cockroachlabs.cloud:26257/customer?sslmode=verify-full"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "aea7ce45-45d0-4f49-8033-aed9c13da58e:customer-api"
        name       = "customer-api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "92dbc6c4-7f2c-438d-8da0-9d4ed4253c27" -> "4ce16b1a-9061-4e6d-be05-07951e3b4d79"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ customer_database_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*